sims/83ml_water_dripping_through_shower/constant/piston/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/piston/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    defaultFaces
    {
        type            patch;
        nFaces          10180;
        startFace       104432;
    }
    piston_to_water
    {
        type            mappedWall;
        inGroups        List<word> 
2
(
wall
mapped
)
;
        nFaces          2012;
        startFace       114612;
        neighbourRegion water;
        neighbourPatch  water_to_piston;
        transformType   none;
    }
)

// ************************************************************************* //
