sims/83ml_water_dripping_through_shower/constant/shower/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/shower/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    showerOuterWall
    {
        type            patch;
        physicalType    patch;
        nFaces          182;
        startFace       2753;
    }
    showerOutlet
    {
        type            patch;
        physicalType    patch;
        nFaces          378;
        startFace       2935;
    }
    shower_to_water
    {
        type            mappedWall;
        inGroups        List<word> 
2
(
wall
mapped
)
;
        nFaces          590;
        startFace       3313;
        neighbourRegion water;
        neighbourPatch  water_to_shower;
        transformType   none;
    }
)

// ************************************************************************* //
