sims/83ml_water_dripping_through_shower/constant/shower/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
//    transport       constIso;
    transport 	    constIsoSolid;
//    thermo          hConst;
    thermo          eConst;    
    equationOfState rhoConst;
    specie          specie;
//    energy          sensibleEnthalpy;
    energy          sensibleInternalEnergy;    
}

mixture
{
    specie
    {
        molWeight   55; // 54.97 https://ask.okorder.com/questions/what-is-the-molar-mass-of-steel_579552.html
    }

    transport
    {
        kappa   16; // 16 https://metalscut4u.com/blog/post/304-stainless-steel-vs-316-stainless-steel.html
    }

    thermodynamics
    {
        Hf      0;
        Cp      450;
        Cv      450;        
    }

    equationOfState
    {
        rho     8000; // 7850 https://www.amardeepsteel.com/blog/density-of-steel.html
    }
}

// ************************************************************************* //
