sims/83ml_water_dripping_through_shower/0/shower/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/piston";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
/*
    showerInlet {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 1.6e-6;		// m3/s or kg/s
    }
    showerOutlet {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 1.6e-6;		// m3/s or kg/s
    }    
*/    
/*
    "showerInlet|showerOutlet" {
        type            calculated;
        value           uniform (0 0 -0.1);
    }
*/    
    /*
    defaultFaces
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    wall
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
    */
}


// ************************************************************************* //
