sims/83ml_water_dripping_through_shower/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: /home/da/cherry/blender_models/piston2_water_shower_flowing/piston_water-lower-region_shower.blend
// Export date: 2025-02-03 17:28:54.029830

numberOfSubdomains 1;

method          scotch;
// method          simple;

simpleCoeffs
{
    n               (1 1 1);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (1 1 1);
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}
