sims/83ml_water_dripping_through_shower/system/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porosity1
{
    type            porosityForce;

    porosityForceCoeffs
    {
        cellZone        shower;

        type            DarcyForchheimer;

        d   (7e5 -1000 -1000);
        f   (0 0 0);

        #coordinateSystem
        #{
        #    type    cartesian;
        #    origin  (0 0 0);
        #    coordinateRotation
        #    {
        #        type    axesRotation;
        #        e1      (0.70710678 0.70710678 0);
        #        e3      (0 0 1);
        #    }
        #}
    }
}


//************************************************************************ //
