sims/83ml_water_dripping_through_shower/system/water/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*

limitTemperature
{
    type	limitTemperature;
    active	true;
    limitTemperatureCoeffs
    {
        selectionMode all;
        min	100;
        max	500;
    }
}
*/

/*
energySource
{
    type            scalarSemiImplicitSource;
    active          true;


    scalarSemiImplicitSourceCoeffs
    {   
        selectionMode   all;
        volumeMode      absolute;//specific;//
        injectionRateSuSp
        {
            h           (0 0); //   q in [W]; or in [W/m³] if you use specific mode
        }     
    }
}
*/

/*
energySource
{
    type            semiImplicitSource;
    select          all;
    volumeMode      absolute;

    sources
    {
        h
        {
            implicit 0;
        }
    }
}
*/

// ************************************************************************* //
